package by.mtereshchenko.Lesson7;

import java.util.Arrays;

/*
Написать метод, который принимает массив и число, метод должен найти это число в массиве и вернуть его индекс,
если такого числа нет, то метод должен вернуть -1.
 */
public class Main6 {
    public static void main(String[] args) {
//        int[] arr = {1, 3, 5};
//        System.out.println(Arrays.toString()num(arr, 5));
//    }
//    static int num (int[] arr, int a){
//        int index = -1;
//        for (int i = 0; i < arr.length; i++) {
//            index = arr[i] == a ? i : index;
//            if (index != -1){
//                break;
//            }
//        }
//        return index;
    }
}
